In [8]:
import pandas as pd

In [9]:
import numpy as np

In [10]:
import matplotlib.pyplot as plt

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [12]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
dates = pd.date_range('20130101' , periods=6)

In [14]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))

In [17]:
df

                   A         B         C         D
2013-01-01 -0.272729  1.704290  0.935510  0.425142
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729
2013-01-03  0.232575  0.067182  0.097336 -0.223412
2013-01-04  0.141039 -0.528826  0.682941  1.197924
2013-01-05 -0.705002 -0.868117 -1.648048 -0.207667
2013-01-06 -1.557556 -0.995786  0.389103  1.582519

In [18]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1, index = list(range(4)), dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test", "train", "test", "train"]),
                     'F' : 'foo'})

In [19]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [101]:
df.head()

          A         B         C         D
0 -0.008768 -0.234757 -0.481784 -1.181587
1 -0.354716  0.313011 -0.774605 -0.298923
2  0.101993 -0.247856  1.692443  0.695420
3  0.754297 -0.849833 -2.133472 -0.336293
4  0.187320  1.474407  1.740719 -0.788970

In [24]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.141039 -0.528826  0.682941  1.197924
2013-01-05 -0.705002 -0.868117 -1.648048 -0.207667
2013-01-06 -1.557556 -0.995786  0.389103  1.582519

In [27]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.values

array([[-0.27272894,  1.70428977,  0.93551023,  0.42514168],
       [-1.54408427, -1.00697766,  0.77240264, -0.17772851],
       [ 0.23257504,  0.06718175,  0.09733586, -0.22341163],
       [ 0.14103933, -0.52882583,  0.68294079,  1.19792355],
       [-0.70500234, -0.86811715, -1.64804759, -0.20766677],
       [-1.55755613, -0.99578641,  0.38910343,  1.58251915]])

In [30]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.617626 -0.271373  0.204874  0.432796
std    0.795839  1.049394  0.955331  0.790049
min   -1.557556 -1.006978 -1.648048 -0.223412
25%   -1.334314 -0.963869  0.170278 -0.200182
50%   -0.488866 -0.698471  0.536022  0.123707
75%    0.037597 -0.081820  0.750037  1.004728
max    0.232575  1.704290  0.935510  1.582519

In [31]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.272729   -1.544084    0.232575    0.141039   -0.705002   -1.557556
B    1.704290   -1.006978    0.067182   -0.528826   -0.868117   -0.995786
C    0.935510    0.772403    0.097336    0.682941   -1.648048    0.389103
D    0.425142   -0.177729   -0.223412    1.197924   -0.207667    1.582519

In [32]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.425142  0.935510  1.704290 -0.272729
2013-01-02 -0.177729  0.772403 -1.006978 -1.544084
2013-01-03 -0.223412  0.097336  0.067182  0.232575
2013-01-04  1.197924  0.682941 -0.528826  0.141039
2013-01-05 -0.207667 -1.648048 -0.868117 -0.705002
2013-01-06  1.582519  0.389103 -0.995786 -1.557556

In [33]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729
2013-01-06 -1.557556 -0.995786  0.389103  1.582519
2013-01-05 -0.705002 -0.868117 -1.648048 -0.207667
2013-01-04  0.141039 -0.528826  0.682941  1.197924
2013-01-03  0.232575  0.067182  0.097336 -0.223412
2013-01-01 -0.272729  1.704290  0.935510  0.425142

In [34]:
df['A']

2013-01-01   -0.272729
2013-01-02   -1.544084
2013-01-03    0.232575
2013-01-04    0.141039
2013-01-05   -0.705002
2013-01-06   -1.557556
Freq: D, Name: A, dtype: float64

In [35]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.272729  1.704290  0.935510  0.425142
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729
2013-01-03  0.232575  0.067182  0.097336 -0.223412

In [36]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729
2013-01-03  0.232575  0.067182  0.097336 -0.223412
2013-01-04  0.141039 -0.528826  0.682941  1.197924

In [37]:
df.loc[dates[0]]

A   -0.272729
B    1.704290
C    0.935510
D    0.425142
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.272729  1.704290
2013-01-02 -1.544084 -1.006978
2013-01-03  0.232575  0.067182
2013-01-04  0.141039 -0.528826
2013-01-05 -0.705002 -0.868117
2013-01-06 -1.557556 -0.995786

In [39]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.544084 -1.006978
2013-01-03  0.232575  0.067182
2013-01-04  0.141039 -0.528826

In [40]:
df.loc[dates[0],'A']

-0.27272894053828334

In [41]:
df.at[dates[0],'A']

-0.27272894053828334

In [42]:
df.iloc[3]

A    0.141039
B   -0.528826
C    0.682941
D    1.197924
Name: 2013-01-04 00:00:00, dtype: float64

In [43]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.141039 -0.528826
2013-01-05 -0.705002 -0.868117

In [44]:
df.iloc[[1, 2, 4],[0, 2]]

                   A         C
2013-01-02 -1.544084  0.772403
2013-01-03  0.232575  0.097336
2013-01-05 -0.705002 -1.648048

In [46]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729
2013-01-03  0.232575  0.067182  0.097336 -0.223412

In [47]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.704290  0.935510
2013-01-02 -1.006978  0.772403
2013-01-03  0.067182  0.097336
2013-01-04 -0.528826  0.682941
2013-01-05 -0.868117 -1.648048
2013-01-06 -0.995786  0.389103

In [48]:
df.iloc[1, 1]

-1.0069776586295385

In [49]:
df.iat[1, 1]

-1.0069776586295385

In [50]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.232575  0.067182  0.097336 -0.223412
2013-01-04  0.141039 -0.528826  0.682941  1.197924

In [51]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.704290  0.935510  0.425142
2013-01-02       NaN       NaN  0.772403       NaN
2013-01-03  0.232575  0.067182  0.097336       NaN
2013-01-04  0.141039       NaN  0.682941  1.197924
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN  0.389103  1.582519

In [52]:
df2 = df.copy()

In [53]:
df2['E'] = ['one', 'one','two','three','four','three']

In [54]:
df2

                   A         B         C         D      E
2013-01-01 -0.272729  1.704290  0.935510  0.425142    one
2013-01-02 -1.544084 -1.006978  0.772403 -0.177729    one
2013-01-03  0.232575  0.067182  0.097336 -0.223412    two
2013-01-04  0.141039 -0.528826  0.682941  1.197924  three
2013-01-05 -0.705002 -0.868117 -1.648048 -0.207667   four
2013-01-06 -1.557556 -0.995786  0.389103  1.582519  three

In [55]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.232575  0.067182  0.097336 -0.223412   two
2013-01-05 -0.705002 -0.868117 -1.648048 -0.207667  four

In [56]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [57]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df['F'] = s1

In [59]:
df.at[dates[0],'A'] = 0

In [60]:
df.iat[0, 1] = 0

In [62]:
df.loc[:,'D'] = np.array([5] * len(df))

In [63]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.935510  5  NaN
2013-01-02 -1.544084 -1.006978  0.772403  5  1.0
2013-01-03  0.232575  0.067182  0.097336  5  2.0
2013-01-04  0.141039 -0.528826  0.682941  5  3.0
2013-01-05 -0.705002 -0.868117 -1.648048  5  4.0
2013-01-06 -1.557556 -0.995786  0.389103  5  5.0

In [64]:
df2 = df.copy()

In [65]:
df2[df2 > 0] = -df2

In [66]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.935510 -5  NaN
2013-01-02 -1.544084 -1.006978 -0.772403 -5 -1.0
2013-01-03 -0.232575 -0.067182 -0.097336 -5 -2.0
2013-01-04 -0.141039 -0.528826 -0.682941 -5 -3.0
2013-01-05 -0.705002 -0.868117 -1.648048 -5 -4.0
2013-01-06 -1.557556 -0.995786 -0.389103 -5 -5.0

In [67]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [68]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [69]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.935510  5  NaN  1.0
2013-01-02 -1.544084 -1.006978  0.772403  5  1.0  1.0
2013-01-03  0.232575  0.067182  0.097336  5  2.0  NaN
2013-01-04  0.141039 -0.528826  0.682941  5  3.0  NaN

In [70]:
df1.dropna(how = 'any')

                   A         B         C  D    F    E
2013-01-02 -1.544084 -1.006978  0.772403  5  1.0  1.0

In [71]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.935510  5  5.0  1.0
2013-01-02 -1.544084 -1.006978  0.772403  5  1.0  1.0
2013-01-03  0.232575  0.067182  0.097336  5  2.0  5.0
2013-01-04  0.141039 -0.528826  0.682941  5  3.0  5.0

In [72]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [73]:
df.mean()

A   -0.572171
B   -0.555421
C    0.204874
D    5.000000
F    3.000000
dtype: float64

In [74]:
df.mean(1)

2013-01-01    1.483878
2013-01-02    0.844268
2013-01-03    1.479419
2013-01-04    1.659031
2013-01-05    1.155767
2013-01-06    1.567152
Freq: D, dtype: float64

In [76]:
s = pd.Series([1,3, 5, np.nan, 6, 8], index=dates).shift(2)

In [77]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [78]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.767425 -0.932818 -0.902664  4.0  1.0
2013-01-04 -2.858961 -3.528826 -2.317059  2.0  0.0
2013-01-05 -5.705002 -5.868117 -6.648048  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [79]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.935510   5   NaN
2013-01-02 -1.544084 -1.006978  1.707913  10   1.0
2013-01-03 -1.311509 -0.939796  1.805249  15   3.0
2013-01-04 -1.170470 -1.468622  2.488190  20   6.0
2013-01-05 -1.875472 -2.336739  0.840142  25  10.0
2013-01-06 -3.433028 -3.332525  1.229245  30  15.0

In [80]:
df.apply(lambda x: x.max() - x.min())

A    1.790131
B    1.074159
C    2.583558
D    0.000000
F    4.000000
dtype: float64

In [82]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [83]:
s

0    5
1    6
2    4
3    3
4    3
5    6
6    3
7    4
8    2
9    3
dtype: int32

In [84]:
s.value_counts()

3    4
6    2
4    2
5    1
2    1
dtype: int64

In [85]:
s = pd.Series(['A','B','C','Aaba','Baca', np.nan, 'CABA','dog','cat'])

In [86]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [88]:
df = pd.DataFrame(np.random.randn(10, 4))

In [89]:
df

          0         1         2         3
0  0.383308 -0.305872  0.183121  1.424269
1 -0.681232  1.497996 -0.855753  0.608454
2 -0.151275 -0.948477  0.375225  2.790154
3 -2.230148  0.218429 -0.469249  1.487787
4  0.040851 -1.089875  0.051752  0.587338
5  0.775451 -1.713469 -1.147994 -1.910980
6 -0.412454  1.033166  0.101891 -0.658207
7 -0.090156  1.122191 -0.747358  0.528947
8 -0.291487 -0.386435 -0.515740  1.157157
9  0.077480  0.524337 -0.824745 -1.228664

In [90]:
pieces = [df[:3], df[3:7], df[7:]]

In [91]:
pd.concat(pieces)

          0         1         2         3
0  0.383308 -0.305872  0.183121  1.424269
1 -0.681232  1.497996 -0.855753  0.608454
2 -0.151275 -0.948477  0.375225  2.790154
3 -2.230148  0.218429 -0.469249  1.487787
4  0.040851 -1.089875  0.051752  0.587338
5  0.775451 -1.713469 -1.147994 -1.910980
6 -0.412454  1.033166  0.101891 -0.658207
7 -0.090156  1.122191 -0.747358  0.528947
8 -0.291487 -0.386435 -0.515740  1.157157
9  0.077480  0.524337 -0.824745 -1.228664

In [92]:
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1, 2]})

In [93]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [94]:
left

   key  lval
0  foo     1
1  foo     2

In [95]:
right

   key  rval
0  foo     4
1  foo     5

In [96]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [97]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [98]:
df

          A         B         C         D
0 -0.008768 -0.234757 -0.481784 -1.181587
1 -0.354716  0.313011 -0.774605 -0.298923
2  0.101993 -0.247856  1.692443  0.695420
3  0.754297 -0.849833 -2.133472 -0.336293
4  0.187320  1.474407  1.740719 -0.788970
5 -0.067553 -0.535222  0.971029 -0.072572
6  0.912984  0.246099  0.979811  1.189410
7  0.413700 -0.245098 -0.354072  0.534513

In [99]:
s = df.iloc[3]

In [100]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.008768 -0.234757 -0.481784 -1.181587
1 -0.354716  0.313011 -0.774605 -0.298923
2  0.101993 -0.247856  1.692443  0.695420
3  0.754297 -0.849833 -2.133472 -0.336293
4  0.187320  1.474407  1.740719 -0.788970
5 -0.067553 -0.535222  0.971029 -0.072572
6  0.912984  0.246099  0.979811  1.189410
7  0.413700 -0.245098 -0.354072  0.534513
8  0.754297 -0.849833 -2.133472 -0.336293